// ================== ฐานข้อมูลพระ (AI Search) ==================
const amuletDB = {
  "พระรอด": {
    album: "รูปพระชุดที่ 1",
    link: "google.html",
    keywords: [
      "พระรอด",
      "พระเปิมลำพูน",
      "พระรอดมหาวันพิมพ์กลาง",
      "พระรอดมหาวันพิมพ์ใหญ่",
      "พระสามกรุเวียงท่ากานเชียงใหม่"
    ]
  },

  "พระกรุเมือง": {
    album: "รูปพระชุดที่ 2",
    link: "mega.html",
    keywords: [
      "พระเครื่องกรุงเทพมหานคร",
      "พระเครื่องเมืองอยุธยา",
      "พระเครื่องเมืองอุตรดิตถ์",
      "พระเครื่องนครปฐม",
      "พระเครื่องอ่างทอง",
      "พระเครื่องเมืองตรัง",
      "พระเครื่องนครนายก",
      "พระเครื่องปทุมธานี",
      "พระผงสุพรรณ"
    ]
  },

  "พระเกจิ": {
    album: "รูปพระชุดที่ 3",
    link: "icedrive.html",
    keywords: [
      "หลวงปู่ฝั้น",
      "หลวงปู่ฝั้น อาจาโร",
      "วัดป่าอุดมสมพร",
      "หลวงปู่ไข่",
      "หลวงปู่ไข่วัดเชิงเลน"
    ]
  }
};

